In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('california_housing_train.csv')

In [12]:
df.head() # вывод первых 5-ти строк

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

In [13]:
df.tail(5) # вывод последних 5-ти строк

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
16995,-124.26,40.58,52.0,2217.0,394.0,907.0,369.0,2.3571,111400.0
16996,-124.27,40.69,36.0,2349.0,528.0,1194.0,465.0,2.5179,79000.0
16997,-124.30,41.84,17.0,2677.0,531.0,1244.0,456.0,3.0313,103600.0
16998,-124.30,41.80,19.0,2672.0,552.0,1298.0,478.0,1.9797,85800.0
16999,-124.35,40.54,52.0,1820.0,300.0,806.0,270.0,3.0147,94600.0

In [14]:
df.columns # вывод всех столбцов

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [15]:
df.shape # размер таблицы

(17000, 9)

In [16]:
df.dtypes # возврат типа данных у каждого столбца

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [17]:
df.isnull().sum() # возврат кол-во null-значений в каждом столбце

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

# Задание 2

In [20]:
# Проверить есть ли в файле пустые значения
df.isnull().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

In [21]:
# error df[0]
df.iloc[0] # вывод строки по номеру(нумерация с 0)
df['housing_median_age']
df[['households', 'housing_median_age']]

       households  housing_median_age
0           472.0                15.0
1           463.0                19.0
2           117.0                17.0
3           226.0                14.0
4           262.0                20.0
...           ...                 ...
16995       369.0                52.0
16996       465.0                36.0
16997       456.0                17.0
16998       478.0                19.0
16999       270.0                52.0

[17000 rows x 2 columns]

In [22]:
# Вариант 1
df.loc[df['median_income'] < 2, 'housing_median_age']

0        15.0
1        19.0
2        17.0
4        20.0
7        41.0
         ...
16984    37.0
16989    32.0
16990    28.0
16994    32.0
16998    19.0
Name: housing_median_age, Length: 2005, dtype: float64

In [23]:
# Вариант 2
df[df['median_income'] < 2]['housing_median_age']

0        15.0
1        19.0
2        17.0
4        20.0
7        41.0
         ...
16984    37.0
16989    32.0
16990    28.0
16994    32.0
16998    19.0
Name: housing_median_age, Length: 2005, dtype: float64

In [24]:
df[(df['housing_median_age'] < 20) & (df['median_house_value'] > 70000)]
# & - и(and)
# | - или(or)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
10,-114.60,33.62,16.0,3741.0,801.0,2434.0,824.0,2.6797,86500.0
23,-114.98,33.82,15.0,644.0,129.0,137.0,52.0,3.2097,71300.0
...,...,...,...,...,...,...,...,...,...
16976,-124.17,40.75,13.0,2171.0,339.0,951.0,353.0,4.8516,116100.0
16983,-124.19,41.78,15.0,3140.0,714.0,1645.0,640.0,1.6654,74600.0
16991,-124.23,41.75,11.0,3159.0,616.0,1343.0,479.0,2.4805,73200.0
16997,-124.30,41.84,17.0,2677.0,531.0,1244.0,456.0,3.0313,103600.0
16998,-124.30,41.80,19.0,2672.0,552.0,1298.0,478.0,1.9797,85800.0

In [26]:
df.iloc[:2] # вывести первые две строки

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0

In [25]:
df[['longitude', 'latitude']]

       longitude  latitude
0        -114.31     34.19
1        -114.47     34.40
2        -114.56     33.69
3        -114.57     33.64
4        -114.57     33.57
...          ...       ...
16995    -124.26     40.58
16996    -124.27     40.69
16997    -124.30     41.84
16998    -124.30     41.80
16999    -124.35     40.54

[17000 rows x 2 columns]

In [27]:
print(df['median_house_value'].min(), df['median_house_value'].max())
# min(), max(), mean() ...

14999.0 500001.0

In [28]:
df['median_house_value'].describe()

count     17000.000000
mean     207300.912353
std      115983.764387
min       14999.000000
25%      119400.000000
50%      180400.000000
75%      265000.000000
max      500001.000000
Name: median_house_value, dtype: float64

In [29]:
df[df['median_income'] == 3.125]['median_house_value'].max()

380400.0

In [19]:
df[df['median_house_value'] == df['median_house_value'].min()]['population'].max()
df.loc[df['median_house_value'] == df['median_house_value'].min(), 'population'].max()

628.0